app/Http/Controllers/AdminAuthController.php

select * from `admins` where `username` = 'test' limit 1
---
    public function login(Request $request)
    {
        $request->validate([
            'username' => 'required',
            'password' => 'required',
        ]);

        $admin = Admin::where('username', '=', $request->username)->first();

select * from `admins` where `id` = 2 limit 1
select count(*) as aggregate from `orders`
select count(*) as aggregate from `users`
select count(*) as aggregate from `vendors`
select count(*) as aggregate from `admins`
select sum(`total_price`) as aggregate from `orders`
select sum(`total_price`) as aggregate from `orders` where `created_at` between '2025-03-01 00:00:00' and '2025-03-31 23:59:59'
---
    public function dashboard()
    {
        $data = array();
        if(session()->has('admin_id')) {
            $data = Admin::where('id', '=' , session()->get('admin_id'))->first();

            /* ──────────────────────────────
         | 1. LIVE COUNTS (KPI cards)
         ──────────────────────────────*/
            $totalBookings  = Order::count();
            $totalCustomers = User::count();
            $totalVendors   = Vendor::count();
            $totalAdmins    = Admin::count();
            $totalRevenue   = Order::sum('total_price') * 0.30;     // admin share

            /* ──────────────────────────────
             | 2. LAST-MONTH COUNTS → deltas
             ──────────────────────────────*/
            $prev = static function ($model) {
                [$from, $to] = [
                    Carbon::now()->subMonth()->startOfMonth(),
                    Carbon::now()->subMonth()->endOfMonth(),
                ];
                return $model::whereBetween('created_at', [$from, $to])->count();
            };

            $prevBookings  = $prev(Order::class);
            $prevCustomers = $prev(User::class);
            $prevVendors   = $prev(Vendor::class);
            $prevAdmins    = $prev(Admin::class);
            $prevRevenue   = Order::whereBetween('created_at', [
                    Carbon::now()->subMonth()->startOfMonth(),
                    Carbon::now()->subMonth()->endOfMonth(),
                ])->sum('total_price') * 0.30;

select count(*) as aggregate from `orders` where year(`created_at`) = 2024 and month(`created_at`) = '11'
---
            for ($i=5;$i>=0;$i--){
                $point = Carbon::now()->subMonths($i);
                $months[] = $point->format('M');
                $bookingData[] = Order::whereYear('created_at',$point->year)
                    ->whereMonth('created_at',$point->month)
                    ->count();

select * from `admins` where `id` = 2 limit 1
select * from `users` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `users`
---
    public function users()
    {
        if(session()->has('admin_id')) {
            $data = Admin::where('id', '=' , session()->get('admin_id'))->first();
            $users = User::latest()->paginate(15);

select * from `properties`
select * from `cars` order by `created_at` desc
select * from `rooms` order by `created_at` desc
select * from `vendors` where `vendors`.`id` in (1)
select * from `admins` where `id` = 2 limit 1
---
    public function listing()
    {
        $properties = Property::with('vendor')->get();
        $cars = Car::orderBy('created_at', 'desc')->get();
        $rooms = Room::with('vendor')->latest()->get();
        if(session()->has('admin_id')) {
            $data = Admin::where('id', '=' , session()->get('admin_id'))->first();

select * from `vendors` where `service` in ('hotel', 'both') limit 10 offset 0
select count(*) as aggregate from `vendors` where `service` in ('hotel', 'both')
select * from `vendors` where `service` in ('car', 'both') limit 10 offset 0
select count(*) as aggregate from `vendors` where `service` in ('car', 'both')
select * from `admins` where `id` = 1 limit 1
---
     public function vendors()
    {
        $hotelVendors = Vendor::whereIn('service', ['hotel', 'both'])->paginate(10, ['*'], 'hotel-page');
        $carVendors = Vendor::whereIn('service', ['car', 'both'])->paginate(10, ['*'], 'car-page');

        if(session()->has('admin_id')) {
            $data = Admin::where('id', '=' , session()->get('admin_id'))->first();

select * from `cars` where `cars`.`id` = '1' limit 1
select * from `admins` where `id` = 1 limit 1
---
    public function viewCar($id)
    {
        $car = Car::findOrFail($id);
        if(session()->has('admin_id')) {
            $data = Admin::where('id', '=' , session()->get('admin_id'))->first();

select * from `cars` where `cars`.`id` = '1' limit 1
update `cars` set `status` = 'approved', `cars`.`updated_at` = '2025-04-24 05:11:37' where `id` = 1
---
    public function approveCar($id)
    {
        $car = Car::findOrFail($id);
        $car->status = 'approved';
        $car->save();

select * from `cars` where `cars`.`id` = '1' limit 1
update `cars` set `status` = 'rejected', `cars`.`updated_at` = '2025-04-24 05:11:36' where `id` = 1
---
    public function rejectCar($id)
    {
        $car = Car::findOrFail($id);
        $car->status = 'rejected';
        $car->save();