app/Http/Controllers/UserController.php

    public function store(Request $request)
    {
        $validated= $request->validate([
            'firstname' => 'required|string|max:100',
            'lastname' => 'required|string|max:100',
            'email' => 'required|email|unique:users,email|max:100',
            'phone_number' => 'required|string|size:11|unique:users,phone_number',  // Ensure phone number length is exactly 11 characters
            'password' => 'required|string|min:6',  // You can adjust the minimum length if needed
        ]);
        $user = new User();
        $user->firstname = $validated['firstname'];
        $user->lastname = $validated['lastname'];
        $user->email = $validated['email'];
        $user->phone_number = $validated['phone_number'];
        $user->password = Hash::make($validated['password']);
        $res = $user->save();
---
insert into `users` (`firstname`, `lastname`, `email`, `phone_number`, `password`, `updated_at`, `created_at`) values ('Abujor', 'Khan', 'abu@gmail.com', '01787212688', '$2y$12$hwXQdYUkYkxfbf6LNI6M9.XfAP2pOsu4JGgorxOeAN3J6A6TMg6fW', '2025-04-24 05:15:06', '2025-04-24 05:15:06')

    public function login(Request $request)
    {
        $request->validate([
            'email' => 'required|email',
            'password' => 'required|string|min:6',
        ]);
        $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'test@blade.com' limit 1

    public function showRoomsByLocation($location)
    {
        $rooms = Room::where('location', $location)->where('status', 'Approved')->get();
---
select * from `rooms` where `location` = 'Sundorban' and `status` = 'Approved'

    public function showCheckoutForm($type, $id)
    {
        // $type will be 'room' or 'car'
        $bookable = ($type === 'room')
            ? Room::findOrFail($id)
            : Car::findOrFail($id);          // add more elseif() as needed
---
select * from `rooms` where `rooms`.`id` = '1' limit 1
select * from `cars` where `cars`.`id` = '1' limit 1

    public function room_checkout(Request $request, $id)
    {
        $data = $request->validate([
            'payment_method'  => 'required|in:card,bkash,nagad',
            'card_number'     => 'required_if:payment_method,card|nullable|string',
            'payment_phone'   => 'required_if:payment_method,bkash,nagad|nullable|string|size:11',
            'check_in_time'   => 'required|date',
            'check_out_time'  => 'nullable|date|after_or_equal:check_in_time',
        ]);

        $room = Room::findOrFail($id);

        $checkIn  = Carbon::parse($data['check_in_time']);
        $checkOut = $data['check_out_time']
            ? Carbon::parse($data['check_out_time'])
            : $checkIn->copy()->addDay();
        $nights = max(1, $checkIn->diffInDays($checkOut));

        $order = Order::create([
            'user_id'       => session('user_id'),
            'vendor_id'     => $room->vendor_id,
            'bookable_type' => Room::class,
            'bookable_id'   => $room->id,
            'start_date'    => $checkIn->toDateString(),
            'end_date'      => $checkOut->toDateString(),
            'total_price'   => $room->price_per_night * $nights,
            'status'        => 'Successful',
        ]);
---
select * from `rooms` where `rooms`.`id` = '6' limit 1
insert into `orders` (`user_id`, `vendor_id`, `bookable_type`, `bookable_id`, `start_date`, `end_date`, `total_price`, `status`, `updated_at`, `created_at`) values (1, 1, 'App\\Models\\Room', 6, '2025-04-24', '2025-04-26', 10000, 'pending', '2025-04-24 01:42:10', '2025-04-24 01:42:10')

    public function showCars()
    {
        $cars = Car::where('status','approved')
            ->latest()->paginate(12);
---
select * from `cars` where `status` = 'approved' order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `cars` where `status` = 'approved'

    public function showCar($id)
    {
        $car = Car::where('status','approved')->findOrFail($id);
---
select * from `cars` where `status` = 'approved' and `cars`.`id` = '1' limit 1

        $rate = $item instanceof Room ? $item->price_per_night : $item->price_per_day;

        /* 5.  Create the order */
        $order = Order::create([
            'user_id'       => session('user_id'),
            'vendor_id'     => $item->vendor_id,
            'bookable_type' => $class,          // morph fields
            'bookable_id'   => $item->id,

            'start_date'    => $checkIn->toDateString(),
            'end_date'      => $checkOut->toDateString(),
            'total_price'   => $rate * $units,

            'status'        => 'successful',
        ]);
---
insert into `orders` (`user_id`, `vendor_id`, `bookable_type`, `bookable_id`, `start_date`, `end_date`, `total_price`, `status`, `updated_at`, `created_at`) values (1, 1, 'App\\Models\\Car', 1, '2025-04-24', '2025-04-26', 8000, 'successful', '2025-04-24 02:45:18', '2025-04-24 02:45:18')