app/Http/Controllers/VendorController.php

    public function store(Request $request)
    {
        $request->validate([
            'firstname' => 'required|string|max:100',
            'lastname' => 'required|string|max:100',
            'email' => 'required|email|unique:vendors,email',
            'phone' => 'required|string|max:20',
            'password' => 'required|min:6|confirmed',
            'service' => 'required|string'
        ]);

        Vendor::create([
            'firstname' => $request->firstname,
            'lastname' => $request->lastname,
            'email' => $request->email,
            'phone' => $request->phone,
            'service' => $request->service,
            'password' => Hash::make($request->password),
        ]);
---
insert into `vendors` (`firstname`, `lastname`, `email`, `phone`, `service`, `password`, `updated_at`, `created_at`) values ('Jobayer', 'Hossain', 'test@blade.com', '01787212622', 'both', '$2y$12$Cr.AHyLLMpWEaytGaOdMqu8EzUNvETmtIiYrkMhaZWZlTWvSao.Zi', '2025-04-24 04:47:43', '2025-04-24 04:47:43')

    public function login(Request $request)
    {
        $request->validate([
            'email'    => 'required|email',
            'password' => 'required'
        ]);

        $vendor = Vendor::where('email', $request->email)->first();
---
select * from `vendors` where `email` = 'test@blade.com' limit 1

            $validated['room_images'] = json_encode([]);
        }

        $room = Room::create($validated);
---
insert into `rooms` (`room_number`, `floor_number`, `room_size`, `room_type`, `num_beds`, `max_capacity`, `air_conditioning`, `wifi`, `balcony`, `price_per_night`, `extra_guest_price`, `available_from`, `available_to`, `room_images`, `location`, `property_name`, `vendor_id`, `updated_at`, `created_at`) values ('4', '4', '400', 'home', '1', '5', '1', '1', '1', '5000', '1000', '2025-04-23', '2025-05-10', '\"[\\\"rooms\\\\\\/K7GwMyxXn9TSqrFoRouCI1Xi6nL3FLfgutNFGcfT.jpg\\\"]\"', 'Sundorban', 'chalek tower', 1, '2025-04-23 21:05:46', '2025-04-23 21:05:46')

    public function showOverview()
    {
        $vendorId = session('vendor_id');

        $properties = Property::where('vendor_id', $vendorId)->latest()->get();
        $cars       = Car::where('vendor_id', $vendorId)->latest()->get();
        $rooms      = Room::where('vendor_id', $vendorId)->latest()->get();
---
select * from `properties` where `vendor_id` = 1 order by `created_at` desc
select * from `cars` where `vendor_id` = 1 order by `created_at` desc
select * from `rooms` where `vendor_id` = 1 order by `created_at` desc

    public function itemDetail($type, $id)
    {
        if ($type === 'property') {
            $item = Property::findOrFail($id);
        } elseif ($type === 'car') {
            $item = Car::findOrFail($id);
        } elseif ($type === 'room') {
            $item = Room::findOrFail($id);
---
select * from `cars` where `cars`.`id` = '1' limit 1
select * from `rooms` where `rooms`.`id` = '6' limit 1